### 1)List Comprehension kullanarak car_crashes icindeki numeric degiskenlerini isimlerinibuyuk harfe cevirin ve basina buuyk harf ekleyin

In [27]:
import seaborn as sns
df = sns.load_dataset("car_crashes")
df.columns

Index(['total', 'speeding', 'alcohol', 'not_distracted', 'no_previous',
       'ins_premium', 'ins_losses', 'abbrev'],
      dtype='object')

In [6]:
df.columns = ["NUM_" + col.upper() if df[col].dtype != "O" else col.upper() for col in df.columns] # Eğer sütunun veri tipi (df[col].dtype) "O" yani object (genelde string) değilse, bu bir sayısal sütundur demektir → Bu durumda başına "NUM_" ekleniyor.

In [8]:
df.columns

Index(['NUM_TOTAL', 'NUM_SPEEDING', 'NUM_ALCOHOL', 'NUM_NOT_DISTRACTED',
       'NUM_NO_PREVIOUS', 'NUM_INS_PREMIUM', 'NUM_INS_LOSSES', 'ABBREV'],
      dtype='object')

### 2)List comprehension yapisi kullanarak car_crashes verisinde isminde "no" barindirmayan degiskenlerin isimlerinin sonuna flag yaziniz

In [22]:
df.columns = [col.upper()+ "_FLAG"  if "no" not in col else col.upper() for col in df.columns]

In [24]:
df.columns

Index(['TOTAL_FLAG', 'SPEEDING_FLAG', 'ALCOHOL_FLAG', 'NOT_DISTRACTED',
       'NO_PREVIOUS', 'INS_PREMIUM_FLAG', 'INS_LOSSES_FLAG', 'ABBREV_FLAG'],
      dtype='object')

### List Comprehension yapisi kullanarak asagida erilen deg isimlerinden farkli olan def isimlerini secin veyteni bi dataframe olusturun ( og_list = ["abbrev","no_previous"])_

In [29]:
og_list = ["abbrev","no_previous"]

In [41]:
new_cols = [col for col in df.columns if col not in og_list]
# [expression for item in iterable if condition]

In [37]:
df_new = df[new_cols]

In [39]:
print(df_new.head())

   total  speeding  alcohol  not_distracted  ins_premium  ins_losses
0   18.8     7.332    5.640          18.048       784.55      145.08
1   18.1     7.421    4.525          16.290      1053.48      133.93
2   18.6     6.510    5.208          15.624       899.47      110.35
3   22.4     4.032    5.824          21.056       827.34      142.39
4   12.0     4.200    3.360          10.920       878.41      165.63

Titanic Veri setindeki kadin ve erkek yolcu sayisini bulunuz

In [66]:
df = sns.load_dataset('Titanic')

In [46]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [62]:
df.groupby("sex")["survived"].count()

sex
female    314
male      577
Name: survived, dtype: int64

### Her bir sutuna ait unique degerlerin sayisini bulun

In [64]:
# Titanic veri setindeki her sütuna ait benzersiz (unique) değerlerin sayısını bulalım
unique_counts = df.nunique()

# Sonuçları yazdıralım
print(unique_counts)

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [72]:
# 'pclass' sütunundaki benzersiz değerlerin sayısını bulalım
unique_class_count = df['pclass'].nunique()
print(unique_class_count)

3